"Add Image" = "Lisää kuva";
"Cancel" = "Kumoa";
"check" = "tarkista";
"Choose..." = "Valitse...";
"Christmas Day" = "Joulupäivä";
"Christmas Eve" = "Jouluaatto";
"Closing in 3 seconds..." = "Suljetaan 3 sekunnissa...";
"DAYS LEFT" = "PÄIVÄÄ JÄLJELLÄ";
"DAYS UNTIL" = "PÄIVÄÄ KUNNES";
"Delete" = "Poista";
"Delete Event" = "Poista tapahtuma";
"Disable Ads" = "Poista mainokset";
"Do you want to disable ads? You can't enable them later." = "Haluatko poistaa mainokset käytöstä? Et voi ottaa niitä enää käyttöön.";
"DONE" = "VALMIS";
"Edit Event" = "Muokkaa tapahtumaa";
"ended on" = "loppui";
"Ended on" = "Loppui";
"Ends on" = "Loppuu";
"HOURS LEFT" = "TUNTIA JÄLJELLÄ";
"HOURS UNTIL" = "TUNTIA KUNNES";
"is happening now" = "tapahtuu nyt";
"MINS LEFT" = "MIN. JÄLJELLÄ";
"MINS UNTIL" = "MIN. KUNNES";
"Name" = "Nimi";
"Description (optional)" = "Kuvaus (valinnainen)";
"New Event" = "Uusi tapahtuma";
"New Year" = "Uusivuosi";
"No Events" = "Ei tapahtumia";
"No Name" = "Ei nimeä";
"Remove Image" = "Poista kuva";
"SECS LEFT" = "SEK. JÄLJELLÄ";
"SECS UNTIL" = "SEK. KUNNES";
"Select a Picture" = "Valitse kuva";
"Started on" = "Alkoi";
"Starts on" = "Alkaa";
"Syncing..." = "Synkronoidaan...";
"Take a Picture" = "Ota kuva";
"WEEKS UNTIL" = "VIIKKOA KUNNES";
"WKS LEFT" = "VIIKKOA JÄLJELLÄ";

